Tuxprogrammer/nfc_lcd/my_pic24_uart.c
# ifndef UART4_RX_INTERRUPT_PRIORITY
#   define UART4_RX_INTERRUPT_PRIORITY 1
# endif

volatile uint8_t au8_rxFifo4[UART4_RX_FIFO_SIZE];
volatile uint16_t u16_rxFifo4Head = 0;
volatile uint16_t u16_rxFifo4Tail = 0;

/**
* Return true if character is ready to be read
*/
uint8_t isCharReady4(void) {
  return(u16_rxFifo4Head != u16_rxFifo4Tail);
}

/**
* Wait for a byte to be available from UART4 RX.
* \return Character read from UART4 RX.
*/
uint8_t inChar4(void) {
  while (u16_rxFifo4Head == u16_rxFifo4Tail)
    doHeartbeat();
  u16_rxFifo4Tail++;
  if (u16_rxFifo4Tail == UART4_RX_FIFO_SIZE) u16_rxFifo4Tail=0; //wrap
  return au8_rxFifo4[u16_rxFifo4Tail]; //return the character
}

void _ISR _U4RXInterrupt (void) {
  int8_t u8_c;

  _U4RXIF = 0;        //clear the UART RX interrupt bit
  checkRxErrorUART4();
  u8_c = U4RXREG;     //read character
  u16_rxFifo4Head++;   //increment head pointer
  if (u16_rxFifo4Head == UART4_RX_FIFO_SIZE)
    u16_rxFifo4Head = 0; //wrap if needed
  if (u16_rxFifo4Head == u16_rxFifo4Tail) {
    //FIFO overrun!, report error
    reportError("UART4 RX Interrupt FIFO overrun!");
  }
  au8_rxFifo4[u16_rxFifo4Head] = u8_c; //place in buffer
}

#else
/**
* Return true if character is ready to be read
*/
uint8_t isCharReady4(void) {
  return(IS_CHAR_READY_UART4());
}

/**
* Wait for a byte to be available from UART4 RX.
* \return Character read from UART4 RX.
*/
uint8_t inChar4(void) {
  //do heartbeat while waiting for character.
  // Use a do-while to insure error checks
  // are always run.
  while (!IS_CHAR_READY_UART4())
    doHeartbeat();
  checkRxErrorUART4();
  return U4RXREG; //read the receive register
}
#endif


// Include this for the non-bootloader case. Also include it for the bootloader if this is the UART the bootloader uses.
#endif // # ifndef BOOTLOADER
#if !defined(BOOTLOADER) || (DEFAULT_UART == 4)

/** Chose a default BRGH for UART4, used by
 *  \ref configUART4 to set up UART4.
 */
#ifndef DEFAULT_BRGH4
# define DEFAULT_BRGH4  DEFAULT_BRGH
#endif

#if (DEFAULT_BRGH4 != 0) && (DEFAULT_BRGH4 != 1)
# error "Invalid value specified for DEFAULT_BRGH4."
#endif


/** Configure the UART. Settings chosen:
 *  - TX is on RP11
 *  - RX is on RP10
 *  - Format is 8 data bits, no parity, 1 stop bit
 *  - CTS, RTS, and BCLK not used
 *
 *  \param u32_baudRate The baud rate to use.
 */
void configUART4(uint32_t u32_baudRate) {
#ifdef _NOFLOAT
  uint32_t u32_brg;
#else
  float f_brg;
#endif

  /*************************  UART config ********************/
  // See comments in the #warning statements below for
  // instructions on how to modify this configuration.
  // More information on each of these board is given
  // in the HARDWARE_PLATFORM section of pic24_libconfig.h.
#if (HARDWARE_PLATFORM == EXPLORER16_100P)
  // There's nothing to do, since pins on these boards are
  // mapped to fixed ports.
#elif (4 == 1)
  // The following pin mappings will apply only to UART 1.
  // Change them as necessary for your device.
# if (HARDWARE_PLATFORM == DANGEROUS_WEB)
  CONFIG_RB14_AS_DIG_INPUT();           // RX pin must be digital input
  CONFIG_U1RX_TO_RP(RB14_RP);           // U1RX <- RB14
  CONFIG_RB15_AS_DIG_OUTPUT();          // TX pin must be digital output
  CONFIG_U1TX_TO_RP(RB15_RP);           // U1TX -> RB15
# elif (HARDWARE_PLATFORM == STARTER_BOARD_28P)
  CONFIG_RB9_AS_DIG_INPUT();            // RX pin must be digital input
  CONFIG_U1RX_TO_RP(RB9_RP);            // U1RX <- RB9
  CONFIG_RB8_AS_DIG_OUTPUT();           // TX pin must be digital output
  CONFIG_U1TX_TO_RP(RB8_RP);            // U1TX -> RB8
# elif (HARDWARE_PLATFORM == DEFAULT_DESIGN)
  CONFIG_RB10_AS_DIG_INPUT();           // RX pin must be digital input
  CONFIG_U1RX_TO_RP(RB10_RP);           // U1RX <- RB10
  CONFIG_RB11_AS_DIG_OUTPUT();          // TX pin must be digital output
  CONFIG_U1TX_TO_RP(RB11_RP);           // U1TX -> RB11
# else
#   error "Unknown hardware platform."
# endif
#else
# warning "UART4 pin mappings not defined. See comments below for more info."
  // If your device has more than one UART, ****** CHANGE THE MAPPING ******
  // since multiple UARTs can not share the same pins. In particular:
  // 1. Change the statement #if (4 == 1) to #if 1
  // 2. Change the pin numbers above
  //    to something valid for your device.
  //    If your device does not have remappable I/O,
  //    (typical for >44 pin packages), skip this step --
  //    the UART I/O pins are already assigned to something
  //    valid.
#endif

  // First, disable the UART, clearing all errors, terminating
  // any in-progress transmissions/receptions, etc.
  // In particular, this clears UTXEN.
  U4MODE = (0u << 15); // UARTEN = 0 to disable.

  /* Configure UART baud rate, based on \ref FCY.
   *  NOTE: Be careful about using BRGH=1 - this uses only four clock
   *  periods to sample each bit and can be very intolerant of
   *  baud rate % error - you may see framing errors. BRGH is selected
   *  via the DEFAULT_BRGH1 define above.
   */
#ifdef _NOFLOAT
  u32_brg = FCY/u32_baudRate;
# if (DEFAULT_BRGH4 == 0)
  if ((u32_brg & 0x0FL) >= 8) u32_brg = u32_brg/16;
  else u32_brg = u32_brg/16 - 1;
# else
  if ((brg & 0x03L) >= 2) u32_brg = u32_brg/4;
  else u32_brg = u32_brg/4 - 1;
# endif
  ASSERT(u32_brg < 65536);
  U4BRG = u32_brg;
#else
# if (DEFAULT_BRGH4 == 0)
  f_brg = (((float) FCY)/((float) u32_baudRate)/16.0) - 1.0;
# else
  f_brg = (((float) FCY)/((float) u32_baudRate)/4.0) - 1.0;
# endif
  ASSERT(f_brg < 65535.5);
  U4BRG = roundFloatToUint16(f_brg);
#endif

  // Set up the UART mode register
  U4MODE =
    (1u   << 15) |      // UARTEN = 1 (enable the UART)
    (0u   << 13) |      // USIDL = 0  (continue operation in idle mode)
    (0u   << 12) |      // IREN = 0   (IrDA encoder and decoder disabled)
    (0u   << 11) |      // RTSMD = 0  (UxRTS# in flow control mode. Given
    //                  //  the UEN setting below, this doesn't matter.)
    (0b00 <<  8) |      // UEN = 00   (UxTX and UxRx pins are enabled and used;
    //                  //  used; UxCTS, UxRTS, and BCLKx pins are
    //                  //  controlled by port latches)
    (0u   <<  7) |      // WAKE = 0   (Wake-up on start bit detect during
    //                  //  sleep mode disabled)
    (0u   <<  6) |      // LPBACK = 0 (UARTx loopback mode is disabled)
    (0u   <<  5) |      // ABAUD = 0  (Auto-baud disabled)
    (0u   <<  4) |      // URXINV = 0 (Receve polarity inversion bit:
    //                  //  UxRX idle state is 1)
    (DEFAULT_BRGH4 << 3) | // BRGH (High/low baud rate select bit:
    //                  //  1 = high speed, 0 = low speed)
    (0b00 <<  1) |      // PDSEL = 00 (8-bit data, no parity)
    (0u   <<  0);       // STSEL = 0  (1 stop bit)

