Tuxprogrammer/nfc_lcd/my_pic24_uart.c
  // Set up the UART status and control register
  U4STA =
    (0u   << 15) |      // UTXISEL1 = 0  (See bit 13 below for explanation)
    (0u   << 14) |      // UTXINV = 0    (UxTX idle state is 1 (though docs
    //                  //  say 0))
    (0u   << 13) |      // UTXISEL0 = 0  (With bit 15 above, UTXISEL = 00:
    //                  //  Interrupt generated when any character
    //                  //  is transferred to the Transmit Shift Register).
    (0u   << 11) |      // UTXBRK = 0    (Sync break transmission disabled)
    (1u   << 10) |      // UTXEN = 0     (UARTx transmitter enabled. NOTE: per
    //                  //  the data sheet, this must be set *AFTER* UARTEN
    //                  //  is set to 1 (see UxMODE assignment above).
    (0b00 <<  6) |      // URXISEL = 00  (Interrupt flag bit is set when a
    //                  //  character is received)
    (0u   <<  5) |      // ADDEN = 0     (Address detect mode disabled)
    (0u   <<  1);       // OERR = 0      (Clear any overrun errors)

  // Delay 1 ms (at least one bit time) before beginning transmission,
  // since the UxTX pin is initially configured as an input on device
  // reset. It needs to be high for at least one bit time before
  // a character is sent in order for the start bit to be recognized.
  // See 24H FRM Sec. 17.5 for more details.
  ASSERT(u32_baudRate >= 1000L);
  // Note: If the baud rate is less than 1000, this delay
  // isn't long encough. The alternative is to use floating-point
  // math to compute the correct delay, which seems worse than the
  // problem.
  DELAY_MS(1);

  // Clear any errors
  U4STAbits.OERR = 0;
  while (U4STAbits.PERR || U4STAbits.FERR) {
    U4RXREG; //clear errors by reading RXREG
  }

  // Set up interrupts if requested
#ifdef UART4_RX_INTERRUPT
  _U4RXIF = 0;            //clear the flag
  _U4RXIP = UART4_RX_INTERRUPT_PRIORITY; //choose a priority
  _U4RXIE = 1;            //enable the interrupt
#endif
#ifdef UART4_TX_INTERRUPT
  //do not clear the U4TXIF flag!
  _U4TXIP = UART4_TX_INTERRUPT_PRIORITY; //choose a priority
  //do not enable the interrupt until we try to write to the UART
#endif

}

#endif // #if !defined(BOOTLOADER) || (DEFAULT_UART == 4)

#endif // #if (NUM_UARTS >= 4)




